Revit 2027 API
EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel Method
 Gets the EnergyAnalysisDetailModel in given document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static EnergyAnalysisDetailModel GetMainEnergyAnalysisDetailModel(
	Document document
)
Public Shared Function GetMainEnergyAnalysisDetailModel (
	document As Document
) As EnergyAnalysisDetailModel
public:
static EnergyAnalysisDetailModel^ GetMainEnergyAnalysisDetailModel(
	Document^ document
)
static member GetMainEnergyAnalysisDetailModel :
        document : Document -> EnergyAnalysisDetailModel
Parameters
document Document
 The document that contains the physical model of the building.
Return Value
EnergyAnalysisDetailModel
 Returns the EnergyAnalysisDetailModel contained in the document, if it exists. If it does not exist, this returns null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace